------------------------------------------------------
      name:  <unnamed>
       log:  /home/pauljohn/GIT/RHS/exercises/Ex-4.2/E
> x-4.2.log
  log type:  text
 opened on:  23 Feb 2016, 17:37:38

. 
. * High School and Beyond data
. * Download OR use previously saved version
. * use http://www.stata-press.com/data/mlmus3/hsb, cl
> ear
. * saveold hsb.dta12, version(12) replace
. use hsb.dta12

. 
. 
. * For more about the HSB, see
. * http://pj.freefaculty.org/guides/stat/DataSets/HSB
. * Especially:
. *    http://pj.freefaculty.org/guides/stat/DataSets/
> HSB/00-README.txt
. 
. 
. * In Hierarchical Linear Models, 2ed, Raudenbush and
>  Bryk make an
. * extensive investigation of the High School and Bey
> ond data. 
. 
. * Two areas of emphasis debate about their estimates
>  project are
. * 1. Substantive meaning of the predictor 
. *    sesdev_ji = ses_ji - sesmean_j,
. *    the deviations of individual SES about their sc
> hool mean SES.
. *
. * There is widespread agreement that inclusion of se
> sdev_ji should
. * also cause us to include sesmean_j in the model. T
> here is a discussion
. * of this in Rabe-Hesketh & Skrondal, 3ed, p. 151-15
> 5. Most MLM books
. * include a discussion of this. "If one deicdes to c
> enter, the only
. * advice we can give in this book is to add the subt
> racted mean to the
. * model" (Ita Kreft and Jan De Leeuw, Introducing Mu
> ltilevel Modeling,
. * p. 191) See also Snijders and Bosker, 2ed, p. 88, 
> where they 
. * emphasize great caution about random slopes on gro
> up-centered predictors.
. *
. * 2. The model for Y includes sesdev_ji as a predict
> or, but
. *    sesmean_j is a predictor in the intercept and s
> lope formulae. This
. *    results in a combined fitting model with an int
> eraction
. *    sesmean_j sesdev_ji 
. *    which is extremely difficult to comprehend, sin
> ce it is the school
. *    mean SES times individual deviations about the 
> school means.
. *    See why it is baffling?
. *    sesmean_j sesdev_ji = sesmean_j (ses_ji - sesme
> an_j)
. *                        = sesmean_j ses_ji - sesmea
> n_j* sesmean_j)
. 
. sum

    Variable |        Obs        Mean    Std. Dev.    
>    Min        Max
-------------+----------------------------------------
> -----------------
    minority |      7,185     .274739    .4464137     
>      0          1
      female |      7,185    .5281837    .4992398     
>      0          1
         ses |      7,185    .0001434    .7793552     
> -3.758      2.692
     mathach |      7,185    12.74785    6.878246     
> -2.832     24.993
        size |      7,185    1056.862    604.1725     
>    100       2713
-------------+----------------------------------------
> -----------------
      sector |      7,185    .4931106    .4999873     
>      0          1
      pracad |      7,185    .5344871    .2511861     
>      0          1
     disclim |      7,185   -.1318694    .9439882     
> -2.416      2.756
     himinty |      7,185    .2800278    .4490438     
>      0          1
    schoolid |      7,185    5277.898    2499.578     
>   1224       9586
-------------+----------------------------------------
> -----------------
        mean |      7,185    12.74785    3.005817   4.
> 239781   19.71914
          sd |      7,185    6.197527    .8637071    3
> .54102   8.481123
       sdalt |      7,185    6.256328           0   6.
> 256328   6.256328
        junk |      7,185    47.31597    48.89761   .0
> 000247   239.2892
      sdalt2 |      7,185    48.39363           0   48
> .39363   48.39363
-------------+----------------------------------------
> -----------------
         num |      7,185    48.01628    10.82218     
>     14         67
          se |      7,185    .9189899    .2017056     
> .50586   1.823741
       sealt |      7,185      .92463    .1291964   .7
> 643321   1.672074
      sealt2 |      7,185    1.028117    .1436564   .8
> 498783   1.859217
          t2 |      7,185     14.6558    26.41601   .0
> 007423   195.8106
-------------+----------------------------------------
> -----------------
       t2alt |      7,185    8.537593    11.06274   .0
> 007485   52.82457
     pickone |      7,185    .0222686    .1475661     
>      0          1
       mmses |      7,185    .0001434    .4135432  -1.
> 193946   .8249825
       mnses |      7,185    .0001434    .4135432  -1.
> 193946   .8249825
          xb |      7,185    12.68545    2.424826   5.
> 683861   17.52193
-------------+----------------------------------------
> -----------------
       resid |      7,185    .0624026    6.459459  -19
> .48889   16.44457

. 
. 
. 
. * I don't trust the undocumented calculation columns
>  in the hsb data, 
. * easy enough to create new group mean and deviation
>  SES
. * Note my naming style. ses is the variable, the mea
> n and group-level
. * deviation are sesmean and sesdev. They stay togeth
> er in the varlist.
. egen sesmean = mean(ses), by(schoolid) 

. gen sesdev = ses-sesmean

. 
. * The R&B p. 80 model, random intercept and slope gi
> ven by 
. * same formula
. *
. * They write 2 levels out using fixed effects gamma,
>  but there's no need 
. * to get exotic.
. 
. * PJ's way of doing the 2 stage model
. * Y is mathach
. * Y = Beta0star + Beta1star sesdev_ji + error_ji
. * j is schoolid in hsb data.
. 
. * ## PJ: Whenever you need a fixed parameter, number
>  next Beta
. * ## PJ: I won't use gammas, no need for fresh set o
> f letters.
. * ## PJ: I use b0 and b1 for the random effects at j
>  level
. 
. * The R&B formula for level 2 intercept and slope
. * Beta0star = Beta0 + Beta2 sesmean_j + Beta3 sector
> _j + b0_j
. * Beta1star = Beta4 + Beta5 sesmean_j + Beta6 sector
> _j + b1_j
. * ## Insert into Y
. * 
. * Y = Beta0 + Beta2 sesmean_j + Beta3 sector_j + b0_
> j +
. *      (Beta4 + Beta5 sesmean_j + Beta6 sector_j + b
> 1_j) sesdev_ji + error_ji
. * 
. *   = Beta0 + Beta2 sesmean_j + Beta3 sector_j + b0_
> j +
. *       Beta4 sesdev_ji + Beta5 sesmean_j sesdev_ji 
> + 
. *       Beta6 sector_j sesdev_ji +
. *      
. *   = Beta0 + Beta2 sesmean_j + Beta3 sector_j + 
. *       Beta4 sesdev_ji + Beta5 sesmean_j sesdev_ji 
> + 
. *       Beta6 sector_j sesdev_ji +
. *       {b0_j +   b1_j sesdev_ji  + error_ji}
. *
. * Hence, we need a model with a random slope on vari
> able sesdev_ji
. 
. 
. * Need to declare sesmean and sesdev as continuous w
> hen used in
. * interactions, else you get this error:
. * sesmean:  factor variables may not contain noninte
> ger values
.  
. 
. * Interesting to compare table R&B p. 82, p value.
. 
. 
. mixed mathach c.sesmean i.sector c.sesdev c.sesmean#
> c.sesdev ///
>      i.sector#c.sesdev || schoolid: c.sesdev, ///
>      mle covariance(unstructured) stddev

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log likelihood = -23249.407  
Iteration 1:   log likelihood = -23248.223  
Iteration 2:   log likelihood = -23248.215  
Iteration 3:   log likelihood = -23248.214  

Computing standard errors:

Mixed-effects ML regression                     Number
>  of obs                                             
>             =                                       
>                    7,185
Group variable: schoolid                        Number
>  of groups                                          
>             =                                       
>                      160

                                                Obs pe
> r group:
                                                      
>         min                                         
>             =                                       
>                       14
                                                      
>         avg                                         
>             =                                       
>                     44.9
                                                      
>         max                                         
>             =                                       
>                       67

                                                Wald c
> hi2(5)                                              
>             =                                       
>                   761.64
Log likelihood = -23248.214                     Prob >
>  chi2                                               
>             =                                       
>                   0.0000

------------------------------------------------------
> ------------------------
     mathach |      Coef.   Std. Err.      z    P>|z| 
>     [95% Con                                        
>             f. Interval]
-------------+----------------------------------------
> ------------------------
     sesmean |   5.331682   .3655621    14.58   0.000 
>     4.615194                                        
>                 6.048171
    1.sector |   1.226862   .3032677     4.05   0.000 
>     .6324679                                        
>                 1.821255
      sesdev |   2.945668   .1539897    19.13   0.000 
>     2.643853                                        
>                 3.247482
             |
   c.sesmean#|
    c.sesdev |   1.042762   .2960158     3.52   0.000 
>     .4625813                                        
>                 1.622942
             |
      sector#|
    c.sesdev |
          1  |  -1.643971   .2373332    -6.93   0.000 
>    -2.109135                                        
>                -1.178806
             |
       _cons |   12.12794   .1974003    61.44   0.000 
>     11.74104                                        
>                 12.51483
------------------------------------------------------
> ------------------------

------------------------------------------------------
> ------------------------
  Random-effects Parameters  |   Estimate   Std. Err. 
>     [95% Conf. Interval]
-----------------------------+------------------------
> ------------------------
schoolid: Unstructured       |
                  sd(sesdev) |    .254774   .4084767  
>      .011001                                        
>                 5.900357
                   sd(_cons) |   1.522162   .1185112  
>     1.306738                                        
>                 1.773099
          corr(sesdev,_cons) |   .4845748   .8773626  
>    -.9376636                                        
>                 .9922743
-----------------------------+------------------------
> ------------------------
                sd(Residual) |   6.059801   .0516675  
>     5.959376                                        
>                 6.161918
------------------------------------------------------
> ------------------------
LR test vs. linear model: chi2(3) = 216.69            
>     Prob > chi2 =                                   
>                   0.0000

Note: LR test is conservative and provided only
      for reference.

. estimates store mfull

. 
end of do-file

. do "/tmp/SD05404.000000"

. 
. mixed mathach c.sesmean i.sector c.sesdev c.sesmean#c.sesdev ///
>      i.sector#c.sesdev || schoolid: c.sesdev, ///
>      mle covariance(unstructured) stddev

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log likelihood = -23249.407  
Iteration 1:   log likelihood = -23248.223  
Iteration 2:   log likelihood = -23248.215  
Iteration 3:   log likelihood = -23248.214  

Computing standard errors:

Mixed-effects ML regression                     Number of obs     =      7,185
Group variable: schoolid                        Number of groups  =        160

                                                Obs per group:
                                                              min =         14
                                                              avg =       44.9
                                                              max =         67

                                                Wald chi2(5)      =     761.64
Log likelihood = -23248.214                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------------
           mathach |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
           sesmean |   5.331682   .3655621    14.58   0.000     4.615194    6.048171
          1.sector |   1.226862   .3032677     4.05   0.000     .6324679    1.821255
            sesdev |   2.945668   .1539897    19.13   0.000     2.643853    3.247482
                   |
c.sesmean#c.sesdev |   1.042762   .2960158     3.52   0.000     .4625813    1.622942
                   |
   sector#c.sesdev |
                1  |  -1.643971   .2373332    -6.93   0.000    -2.109135   -1.178806
                   |
             _cons |   12.12794   .1974003    61.44   0.000     11.74104    12.51483
------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
schoolid: Unstructured       |
                  sd(sesdev) |    .254774   .4084767       .011001    5.900357
                   sd(_cons) |   1.522162   .1185112      1.306738    1.773099
          corr(sesdev,_cons) |   .4845748   .8773626     -.9376636    .9922743
-----------------------------+------------------------------------------------
                sd(Residual) |   6.059801   .0516675      5.959376    6.161918
------------------------------------------------------------------------------
LR test vs. linear model: chi2(3) = 216.69                Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. estimates store mfull

. 
end of do-file

. do "/tmp/SD05404.000000"

.  
. mixed mathach c.sesmean i.sector c.ses c.sesmean#c.ses ///
>      i.sector#c.ses || schoolid: c.sesdev, ///
>      mle covariance(unstructured) stddev

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log likelihood = -23249.734  
Iteration 1:   log likelihood = -23248.579  
Iteration 2:   log likelihood = -23248.571  
Iteration 3:   log likelihood =  -23248.57  

Computing standard errors:

Mixed-effects ML regression                     Number of obs     =      7,185
Group variable: schoolid                        Number of groups  =        160

                                                Obs per group:
                                                              min =         14
                                                              avg =       44.9
                                                              max =         67

                                                Wald chi2(5)      =     758.37
Log likelihood =  -23248.57                     Prob > chi2       =     0.0000

---------------------------------------------------------------------------------
        mathach |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
        sesmean |   3.274976   .3877974     8.45   0.000     2.514907    4.035044
       1.sector |   1.208552   .3043105     3.97   0.000     .6121148     1.80499
            ses |   2.910367   .1512488    19.24   0.000     2.613924    3.206809
                |
c.sesmean#c.ses |   .8422617   .2753455     3.06   0.002     .3025944    1.381929
                |
   sector#c.ses |
             1  |  -1.576702   .2278533    -6.92   0.000    -2.023286   -1.130118
                |
          _cons |   12.10873   .2010682    60.22   0.000     11.71464    12.50281
---------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
schoolid: Unstructured       |
--Break--
r(1);

end of do-file

--Break--
r(1);

. exit, clear
