--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/pauljohn/GIT/RHS/exercises/Ex-3.1/3.1.log
  log type:  text
 opened on:  23 Feb 2016, 13:57:35

. 
. 
. *use http://www.stata-press.com/data/mlmus3/neighborhood, clear
. *save neighborhood.dta
. 
. use neighborhood.dta

. 
. xtmixed attain || neighid:  , mle

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log likelihood = -3207.9869  
Iteration 1:   log likelihood = -3207.9847  
Iteration 2:   log likelihood = -3207.9847  

Computing standard errors:

Mixed-effects ML regression                     Number of obs     =      2,310
Group variable: neighid                         Number of groups  =        524

                                                Obs per group:
                                                              min =          1
                                                              avg =        4.4
                                                              max =         16

                                                Wald chi2(0)      =          .
Log likelihood = -3207.9847                     Prob > chi2       =          .

------------------------------------------------------------------------------
      attain |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   .0820248   .0284356     2.88   0.004     .0262921    .1377575
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
neighid: Identity            |
                   sd(_cons) |     .44893   .0286505       .396146    .5087472
-----------------------------+------------------------------------------------
                sd(Residual) |   .8968671   .0148151      .8682951    .9263793
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 148.18        Prob >= chibar2 = 0.0000

. estimates store empty

. 
. xtmixed attain deprive || neighid: , mle

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log likelihood = -3133.0664  
Iteration 1:   log likelihood = -3132.7913  
Iteration 2:   log likelihood = -3132.7913  

Computing standard errors:

Mixed-effects ML regression                     Number of obs     =      2,310
Group variable: neighid                         Number of groups  =        524

                                                Obs per group:
                                                              min =          1
                                                              avg =        4.4
                                                              max =         16

                                                Wald chi2(1)      =     185.47
Log likelihood = -3132.7913                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
      attain |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     deprive |  -.5207748   .0382401   -13.62   0.000    -.5957239   -.4458256
       _cons |   .0999478   .0236743     4.22   0.000     .0535471    .1463486
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
neighid: Identity            |
                   sd(_cons) |   .2929072   .0316381      .2370218    .3619692
-----------------------------+------------------------------------------------
                sd(Residual) |   .9012219   .0149279      .8724335    .9309602
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 34.30         Prob >= chibar2 = 0.0000

. estimates store l2re

. 
. xtmixed attain deprive, mle

Mixed-effects ML regression                     Number of obs     =      2,310

                                                Wald chi2(1)      =     279.98
Log likelihood = -3149.9404                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
      attain |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     deprive |  -.5298001    .031663   -16.73   0.000    -.5918584   -.4677418
       _cons |   .1048742   .0196983     5.32   0.000     .0662662    .1434822
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
                sd(Residual) |   .9461748   .0139204       .919281    .9738554
------------------------------------------------------------------------------

. estimates store l2nore

. lrtest l2re l2nore

Likelihood-ratio test                                 LR chi2(1)  =     34.30
(Assumption: l2nore nested in l2re)                   Prob > chi2 =    0.0000

Note: The reported degrees of freedom assumes the null hypothesis is not on
      the boundary of the parameter space.  If this is not true, then the
      reported test is conservative.

. 
. xtmixed attain p7vrq p7read dadocc dadunemp daded momed male deprive || neighi
> d: , mle

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log likelihood = -2391.2346  
Iteration 1:   log likelihood = -2387.5021  
Iteration 2:   log likelihood = -2387.4993  
Iteration 3:   log likelihood = -2387.4993  

Computing standard errors:

Mixed-effects ML regression                     Number of obs     =      2,310
Group variable: neighid                         Number of groups  =        524

                                                Obs per group:
                                                              min =          1
                                                              avg =        4.4
                                                              max =         16

                                                Wald chi2(8)      =    2641.64
Log likelihood = -2387.4993                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
      attain |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       p7vrq |   .0277629    .002256    12.31   0.000     .0233413    .0321846
      p7read |   .0260652   .0017461    14.93   0.000     .0226429    .0294874
      dadocc |   .0082389   .0013631     6.04   0.000     .0055672    .0109107
    dadunemp |  -.1148958   .0468304    -2.45   0.014    -.2066818   -.0231099
       daded |   .1409657   .0408102     3.45   0.001     .0609792    .2209523
       momed |    .062405   .0374538     1.67   0.096    -.0110031    .1358131
        male |  -.0553814   .0284337    -1.95   0.051    -.1111105    .0003477
     deprive |  -.1481233   .0253307    -5.85   0.000    -.1977706   -.0984759
       _cons |   .0807311   .0229586     3.52   0.000      .035733    .1257291
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
neighid: Identity            |
                   sd(_cons) |   .0789155   .0432471      .0269581    .2310127
-----------------------------+------------------------------------------------
                sd(Residual) |   .6757447   .0110068      .6545124    .6976657
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 0.91          Prob >= chibar2 = 0.1698

. estimates store l1l2re

. 
. xtmixed attain p7vrq p7read dadocc dadunemp daded momed male deprive

Mixed-effects ML regression                     Number of obs     =      2,310

                                                Wald chi2(8)      =    2699.70
Log likelihood = -2387.9552                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
      attain |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       p7vrq |    .027782    .002256    12.31   0.000     .0233604    .0322036
      p7read |   .0261122    .001745    14.96   0.000     .0226921    .0295323
      dadocc |   .0083345    .001361     6.12   0.000     .0056669    .0110021
    dadunemp |  -.1145047   .0468384    -2.44   0.014    -.2063062   -.0227032
       daded |   .1421081   .0408069     3.48   0.000      .062128    .2220882
       momed |   .0624403   .0374596     1.67   0.096    -.0109791    .1358597
        male |  -.0552479    .028455    -1.94   0.052    -.1110186    .0005229
     deprive |  -.1482082   .0245795    -6.03   0.000    -.1963831   -.1000332
       _cons |   .0805073   .0226596     3.55   0.000     .0360952    .1249193
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
                sd(Residual) |   .6803202    .010009       .660983    .7002231
------------------------------------------------------------------------------

. estimates store l1l2nore

. 
. lrtest l1l2re l1l2nore

Likelihood-ratio test                                 LR chi2(1)  =      0.91
(Assumption: l1l2nore nested in l1l2re)               Prob > chi2 =    0.3396

Note: The reported degrees of freedom assumes the null hypothesis is not on
      the boundary of the parameter space.  If this is not true, then the
      reported test is conservative.

. 
. xtmixed attain p7vrq p7read dadocc i.dadunemp i.daded i.momed i.male deprive |
> | neighid: , mle

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log likelihood = -2391.2346  
Iteration 1:   log likelihood = -2387.5021  
Iteration 2:   log likelihood = -2387.4993  
Iteration 3:   log likelihood = -2387.4993  

Computing standard errors:

Mixed-effects ML regression                     Number of obs     =      2,310
Group variable: neighid                         Number of groups  =        524

                                                Obs per group:
                                                              min =          1
                                                              avg =        4.4
                                                              max =         16

                                                Wald chi2(8)      =    2641.64
Log likelihood = -2387.4993                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
      attain |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       p7vrq |   .0277629    .002256    12.31   0.000     .0233413    .0321846
      p7read |   .0260652   .0017461    14.93   0.000     .0226429    .0294874
      dadocc |   .0082389   .0013631     6.04   0.000     .0055672    .0109107
  1.dadunemp |  -.1148958   .0468304    -2.45   0.014    -.2066818   -.0231099
     1.daded |   .1409657   .0408102     3.45   0.001     .0609792    .2209523
     1.momed |    .062405   .0374538     1.67   0.096    -.0110031    .1358131
      1.male |  -.0553814   .0284337    -1.95   0.051    -.1111105    .0003477
     deprive |  -.1481233   .0253307    -5.85   0.000    -.1977706   -.0984759
       _cons |   .0807311   .0229586     3.52   0.000      .035733    .1257291
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
neighid: Identity            |
                   sd(_cons) |   .0789155   .0432471      .0269581    .2310127
-----------------------------+------------------------------------------------
                sd(Residual) |   .6757447   .0110068      .6545124    .6976657
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 0.91          Prob >= chibar2 = 0.1698

. 
. 
end of do-file

. exit, clear
